RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_gpc.h
/*
 * Copyright 2019-2021 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_GPC_H_
#define _FSL_GPC_H_

#include "fsl_common.h"

/*!
 * @addtogroup gpc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief GPC driver version 2.2.0. */
#define FSL_GPC_RIVER_VERSION (MAKE_VERSION(2, 2, 0))
/*! @}*/

#define GPC_RESERVED_USE_MACRO 0xFFFFFFFFU

/* GPC CPU module step control register offset. */
#define GPC_CM_SLEEP_SSAR_CTRL_OFFSET   (0x200)
#define GPC_CM_SLEEP_LPCG_CTRL_OFFSET   (0x208)
#define GPC_CM_SLEEP_PLL_CTRL_OFFSET    (0x210)
#define GPC_CM_SLEEP_ISO_CTRL_OFFSET    (0x218)
#define GPC_CM_SLEEP_RESET_CTRL_OFFSET  (0x220)
#define GPC_CM_SLEEP_POWER_CTRL_OFFSET  (0x228)
#define GPC_CM_WAKEUP_POWER_CTRL_OFFSET (0x290)
#define GPC_CM_WAKEUP_RESET_CTRL_OFFSET (0x298)
#define GPC_CM_WAKEUP_ISO_CTRL_OFFSET   (0x2A0)
#define GPC_CM_WAKEUP_PLL_CTRL_OFFSET   (0x2A8)
#define GPC_CM_WAKEUP_LPCG_CTRL_OFFSET  (0x2B0)
#define GPC_CM_WAKEUP_SSAR_CTRL_OFFSET  (0x2B8)

/* GPC set point module step control register offset. */
#define GPC_SP_SSAR_SAVE_CTRL_OFFSET    (0x100)
#define GPC_SP_LPCG_OFF_CTRL_OFFSET     (0x110)
#define GPC_SP_GROUP_DOWN_CTRL_OFFSET   (0x120)
#define GPC_SP_ROOT_DOWN_CTRL_OFFSET    (0x130)
#define GPC_SP_PLL_OFF_CTRL_OFFSET      (0x140)
#define GPC_SP_ISO_ON_CTRL_OFFSET       (0x150)
#define GPC_SP_RESET_EARLY_CTRL_OFFSET  (0x160)
#define GPC_SP_POWER_OFF_CTRL_OFFSET    (0x170)
#define GPC_SP_BIAS_OFF_CTRL_OFFSET     (0x180)
#define GPC_SP_BG_PLDO_OFF_CTRL_OFFSET  (0x190)
#define GPC_SP_LDO_PRE_CTRL_OFFSET      (0x1A0)
#define GPC_SP_DCDC_DOWN_CTRL_OFFSET    (0x1B0)
#define GPC_SP_DCDC_UP_CTRL_OFFSET      (0x2B0)
#define GPC_SP_LDO_POST_CTRL_OFFSET     (0x210)
#define GPC_SP_BG_PLDO_ON_CTRL_OFFSET   (0x220)
#define GPC_SP_BIAS_ON_CTRL_OFFSET      (0x230)
#define GPC_SP_POWER_ON_CTRL_OFFSET     (0x240)
#define GPC_SP_RESET_LATE_CTRL_OFFSET   (0x250)
#define GPC_SP_ISO_OFF_CTRL_OFFSET      (0x260)
#define GPC_SP_PLL_ON_CTRL_OFFSET       (0x270)
#define GPC_SP_ROOT_UP_CTRL_OFFSET      (0x280)
#define GPC_SP_GROUP_UP_CTRL_OFFSET     (0x290)
#define GPC_SP_LPCG_ON_CTRL_OFFSET      (0x2A0)
#define GPC_SP_SSAR_RESTORE_CTRL_OFFSET (0x2B0)

/* GPC standby module step control register offset. */
#define GPC_STBY_LPCG_IN_CTRL_OFFSET     (0xF0)
#define GPC_STBY_PLL_IN_CTRL_OFFSET      (0x100)
#define GPC_STBY_BIAS_IN_CTRL_OFFSET     (0x110)
#define GPC_STBY_PLDO_IN_CTRL_OFFSET     (0x120)
#define GPC_STBY_BANDGAP_IN_CTRL_OFFSET  (0x128)
#define GPC_STBY_LDO_IN_CTRL_OFFSET      (0x130)
#define GPC_STBY_DCDC_IN_CTRL_OFFSET     (0x140)
#define GPC_STBY_PMIC_IN_CTRL_OFFSET     (0x150)
#define GPC_STBY_PMIC_OUT_CTRL_OFFSET    (0x200)
#define GPC_STBY_DCDC_OUT_CTRL_OFFSET    (0x210)
#define GPC_STBY_LDO_OUT_CTRL_OFFSET     (0x220)
#define GPC_STBY_BANDGAP_OUT_CTRL_OFFSET (0x238)
#define GPC_STBY_PLDO_OUT_CTRL_OFFSET    (0x238)
#define GPC_STBY_BIAS_OUT_CTRL_OFFSET    (0x240)
#define GPC_STBY_PLL_OUT_CTRL_OFFSET     (0x250)
#define GPC_STBY_LPCG_OUT_CTRL_OFFSET    (0x260)

/* GPC CPU module step register offset. */
#define GPC_CM_STEP_REG_OFFSET                                                                               \
    {                                                                                                        \
        GPC_CM_SLEEP_SSAR_CTRL_OFFSET, GPC_CM_SLEEP_LPCG_CTRL_OFFSET, GPC_CM_SLEEP_PLL_CTRL_OFFSET,          \
            GPC_CM_SLEEP_ISO_CTRL_OFFSET, GPC_CM_SLEEP_RESET_CTRL_OFFSET, GPC_CM_SLEEP_POWER_CTRL_OFFSET,    \
            GPC_RESERVED_USE_MACRO, GPC_RESERVED_USE_MACRO, GPC_RESERVED_USE_MACRO, GPC_RESERVED_USE_MACRO,  \
            GPC_CM_WAKEUP_POWER_CTRL_OFFSET, GPC_CM_WAKEUP_RESET_CTRL_OFFSET, GPC_CM_WAKEUP_ISO_CTRL_OFFSET, \
            GPC_CM_WAKEUP_PLL_CTRL_OFFSET, GPC_CM_WAKEUP_LPCG_CTRL_OFFSET, GPC_CM_WAKEUP_SSAR_CTRL_OFFSET,   \
    }

/* GPC set point module step control register offset. */
#define GPC_SP_STEP_REG_OFFSET                                                                         \
    {                                                                                                  \
        GPC_SP_SSAR_SAVE_CTRL_OFFSET, GPC_SP_LPCG_OFF_CTRL_OFFSET, GPC_SP_GROUP_DOWN_CTRL_OFFSET,      \
            GPC_SP_ROOT_DOWN_CTRL_OFFSET, GPC_SP_PLL_OFF_CTRL_OFFSET, GPC_SP_ISO_ON_CTRL_OFFSET,       \
            GPC_SP_RESET_EARLY_CTRL_OFFSET, GPC_SP_POWER_OFF_CTRL_OFFSET, GPC_SP_BIAS_OFF_CTRL_OFFSET, \
            GPC_SP_BG_PLDO_OFF_CTRL_OFFSET, GPC_SP_LDO_PRE_CTRL_OFFSET, GPC_SP_DCDC_DOWN_CTRL_OFFSET,  \
            GPC_SP_DCDC_UP_CTRL_OFFSET, GPC_SP_LDO_POST_CTRL_OFFSET, GPC_SP_BG_PLDO_ON_CTRL_OFFSET,    \
            GPC_SP_BIAS_ON_CTRL_OFFSET, GPC_SP_POWER_ON_CTRL_OFFSET, GPC_SP_RESET_LATE_CTRL_OFFSET,    \
            GPC_SP_ISO_OFF_CTRL_OFFSET, GPC_SP_PLL_ON_CTRL_OFFSET, GPC_SP_ROOT_UP_CTRL_OFFSET,         \
            GPC_SP_GROUP_UP_CTRL_OFFSET, GPC_SP_LPCG_ON_CTRL_OFFSET, GPC_SP_SSAR_RESTORE_CTRL_OFFSET,  \
    }

/* GPC standby module step register offset. */
#define GPC_STBY_STEP_REG_OFFSET                                                                           \
    {                                                                                                      \
        GPC_STBY_LPCG_IN_CTRL_OFFSET, GPC_STBY_PLL_IN_CTRL_OFFSET, GPC_STBY_BIAS_IN_CTRL_OFFSET,           \
            GPC_STBY_PLDO_IN_CTRL_OFFSET, GPC_STBY_BANDGAP_IN_CTRL_OFFSET, GPC_STBY_LDO_IN_CTRL_OFFSET,    \
            GPC_STBY_DCDC_IN_CTRL_OFFSET, GPC_STBY_PMIC_IN_CTRL_OFFSET, GPC_STBY_PMIC_OUT_CTRL_OFFSET,     \
            GPC_STBY_DCDC_OUT_CTRL_OFFSET, GPC_STBY_LDO_OUT_CTRL_OFFSET, GPC_STBY_BANDGAP_OUT_CTRL_OFFSET, \
            GPC_STBY_PLDO_OUT_CTRL_OFFSET, GPC_STBY_BIAS_OUT_CTRL_OFFSET, GPC_STBY_PLL_OUT_CTRL_OFFSET,    \
            GPC_STBY_LPCG_OUT_CTRL_OFFSET,                                                                 \
    }

/* Make/Get status. */
/* Make the mask/shift value of GPC status register in a variable. */
#define GPC_STAT(mask, shift) (uint32_t)(((uint32_t)(shift) << 16UL) + ((uint32_t)(mask) >> (uint32_t)(shift)))

#define GPC_CM_ALL_INTERRUPT_STATUS                                     \
    (GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SLEEP_INT_MASK |  \
     GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_WAKEUP_INT_MASK | \
     GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SOFT_INT_MASK)

/*! @brief _gpc_cm_non_irq_wakeup_request GPC Non-IRQ wakeup request. */
enum
{
    kGPC_CM_EventWakeupRequest =
        GPC_CPU_MODE_CTRL_CM_NON_IRQ_WAKEUP_MASK_EVENT_WAKEUP_MASK_MASK, /*!< Event wakeup request. */
    kGPC_CM_DebugWakeupRequest =
        GPC_CPU_MODE_CTRL_CM_NON_IRQ_WAKEUP_MASK_DEBUG_WAKEUP_MASK_MASK, /*!< Debug wakeup request. */
};

